linux_tool/linux_tips.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-18 Mon 20:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux tools/tips</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Quan Vu" />
<link rel="stylesheet" href="https://vhquan.github.io/css/style.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">Linux tools/tips</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5056872">1. Disable touchpad on linux using the command line</a></li>
<li><a href="#org6abf859">2. Makefile command substitution</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5056872" class="outline-2">
<h2 id="org5056872"><span class="section-number-2">1</span> Disable touchpad on linux using the command line</h2>
<div class="outline-text-2" id="text-1">
<p>
You could also use/install xinput.
Run the command <code>xinput</code>, it will give you a list of input devices, find your
touchpad in the list and it's number (id) = NUMOFDEV.
</p>

<div class="org-src-container">
<pre class="src src-bash">xinput set-prop NUMOFDEV "Device Enabled" 0
</pre>
</div>

<p>
That should disable it.
</p>
</div>
</div>

<div id="outline-container-org6abf859" class="outline-2">
<h2 id="org6abf859"><span class="section-number-2">2</span> Makefile command substitution</h2>
<div class="outline-text-2" id="text-2">
<p>
My Makefile
</p>
<div class="org-src-container">
<pre class="src src-makefile">all: ... (other rules) clean

clean:
    rm $(find . -type f -executable)
</pre>
</div>
<p>
When I delete <code>clean</code> rule from the above Makefile everything works as
expected. After adding, <code>make</code> (also <code>make clean</code>) command results in:
</p>
<div class="org-src-container">
<pre class="src src-bash">rm
rm: missing operand
Try 'rm --help' for more information
make: *** [Makefile: 46: clean] Error 1
</pre>
</div>
<p>
What causes problem here and how can I solve?
</p>

<p>
<b>Answer</b>:
There are several issues.
</p>

<p>
<b>Passing a $ sign in a Makefile to the shell</b>
You want to run the command
</p>
<div class="org-src-container">
<pre class="src src-bash">rm $(find . -type f -executable)
</pre>
</div>
<p>
to let the shell do the command substitution. To do this you need to write
</p>
<div class="org-src-container">
<pre class="src src-makefile">clean:
    rm $$(find . -type f -executable)
</pre>
</div>
<p>
with the dollar doubled as Make itself us <code>$</code>
</p>

<p>
<a href="https://unix.stackexchange.com/questions/669679/makefile-command-substitution">https://unix.stackexchange.com/questions/669679/makefile-command-substitution</a>
</p>
</div>
</div>
</div>
</body>
</html>
